/*Задача 27: Напишите программу, которая принимает на вход число 
и выдаёт сумму цифр в числе.

452 -> 11
82 -> 10
9012 -> 12
*/
int N;
Console.Write($"Ввведите число = ");
int.TryParse(Console.ReadLine()!, out N);



Console.Write($"{sum}");